app/controllers/clients_controller.rb

INSERT INTO "clients" ("created_at", "first", "last", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-03-20 18:38:06.356601"], ["first", "Ben"], ["last", "Jones"], ["updated_at", "2015-03-20 18:38:06.356601"], ["user_id", 2]]
---
  def create
    @client = current_user.clients.build(client_params)
    @client.user = current_user

    if @client.save