app/controllers/registrations_controller.rb

  def create
    build_resource
    resource = User.new(params[:user])
    if resource.save
---
INSERT INTO "users" ("authentication_token", "created_at", "email", "encrypted_password", "first", "last", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)