app/controllers/sessions_controller.rb

  def destroy
    warden.authenticate!(:scope => resource_name, :recall => "#{controller_path}#failure")
    current_user.update_column(:authentication_token, nil)
---
UPDATE "users" SET "authentication_token" = NULL WHERE "users"."id" = 2